#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-f58s2E6hfE7L45Qr

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.api_lambdas["createHouse"].data.archive_file.source_code: Refreshing...
module.api_lambdas["initLease"].data.archive_file.source_code: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refreshing...
module.api_lambdas["createHouse"].data.archive_file.source_code: Refresh complete after 0s [id=25b75e1a5a6cff6b9496ba7c6c10e468b9d0c1e4]
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refresh complete after 0s [id=bc2c03be875cc2f88f8a3ad35ee21dd7b18823c3]
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8e8dff93783493389ac68438bb9a05cf6abee9e]
module.api_lambdas["initLease"].data.archive_file.source_code: Refresh complete after 0s [id=66f8eb07d25c97e7b2c8980dc7d151728270897c]
module.api_lambdas["getHouses"].data.archive_file.source_code: Refresh complete after 0s [id=ddaec4202bf058bbe915c0faf38dca9890196b70]
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refresh complete after 0s [id=e577589b24b8fbb044463c9d89b1b1122f330187]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket: Refreshing state... [id=paymentCollector_lambda.zip]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket: Refreshing state... [id=initLease_lambda.zip]
module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket: Refreshing state... [id=getHouses_lambda.zip]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket: Refreshing state... [id=createHouse_lambda.zip]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Refreshing state... [id=us-west-2_3oKP9s8K9]
module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket: Refreshing state... [id=houseOverview_lambda.zip]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function: Refreshing state... [id=paymentCollector_TF]
module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function: Refreshing state... [id=houseOverview_TF]
module.api_lambdas["createHouse"].aws_lambda_function.lambda_function: Refreshing state... [id=createHouse_TF]
module.api_lambdas["getHouses"].aws_lambda_function.lambda_function: Refreshing state... [id=getHouses_TF]
module.api_lambdas["initLease"].aws_lambda_function.lambda_function: Refreshing state... [id=initLease_TF]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain: Refreshing state... [id=maxfrise]
module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0]: Refreshing state... [id=7akg4pgnuu8tss89ht74djv5lp]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
data.template_file.maxfrise_api_v2_spec: Refreshing...
data.template_file.maxfrise_api_v2_spec: Refresh complete after 0s [id=c533b0bd539c3094fb290e15cfaca435822d7a30bef9b2592862bf0d8745bed6]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.api_lambdas["initLease"].aws_lambda_function.lambda_function: Drift detected (update)
module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket: Drift detected (update)
module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket: Drift detected (update)
module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function: Drift detected (update)
module.api_lambdas["getHouses"].aws_lambda_function.lambda_function: Drift detected (update)
module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket: Drift detected (update)
module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket: Drift detected (update)
module.api_lambdas["createHouse"].aws_lambda_function.lambda_function: Drift detected (update)
module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket: Drift detected (update)
module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_rest_api.api_v2 will be created
  + resource "aws_api_gateway_rest_api" "api_v2" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + body                         = <<-EOT
            openapi: "3.0.1"
            info:
              title: "Maxfrise API v2"
              version: "1.0"
            paths:
              /initLease:
                post:
                  summary: "Service to initialize the lease"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/{initLeaseLambdaArn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /paymentCollector:
                post:
                  summary: "Service to collect payments"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/{paymentCollectorLambdaArn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /createHouse:
                post:
                  summary: "Service to create houses"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/{createHouseLambdaArn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /getHouses:
                get:
                  summary: "Service to get houses"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/{getHousesLambdaArn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
              /houseOverview:
                get:
                  summary: "Function to get the house overview"
                  responses:
                    '200':
                      description: "Successful response"
                  x-amazon-apigateway-integration:
                    uri: "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/{houseOverviewLambdaArn}/invocations"
                    passthroughBehavior: "when_no_match"
                    httpMethod: "POST"
                    type: "aws_proxy"
        EOT
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "MaxfriseApiV2"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*